/** 변수 **/
// 변경이 가능한 값, var 키워드로 선언
var 변수 = "내용이 변경 가능" // 변수 type은 compiler가 추론
print(변수)
변수 = "사실 메모리에서 인스턴스의 주소 변경이 가능하다고 이해하는게 맞을듯"
print(변수)
// 변수 = 0
// 그렇지만 다른 타입으로는 변경이 불가

/* 상수 */
// 한번 정의하면 변경이 불가능, let 키워드로 선언
let 상수 = "내용 변경이 불가능하다"
print(상수)
// 상수 = "변경하려면 에러가 발생한다"

/* 타입 선언 */
// 변수명 뒤에 :[타입]으로 선언이 가능하다
var 정수형변수: Int
정수형변수 = 10
print(정수형변수)
// 타입 명시후 한번에 선언
var 실수형변수: Float = 10.10
print(실수형변수)

/* 연산자 */
// 산술 +, -, *, /, %(나머지)
print( 정수형변수%3 )
// 산술단항 +, - (부호 연산자: - 띄어쓰기 조심)
print( 2 + -2)
// 증감연산자 ++, -- 연산자는 swift3 부터 사용 불가능
정수형변수 += 1 // 대신에 복합 연산자를 사용할 것
// 복합 연산자 +=, -=, *=, /=
정수형변수 *= 3 // [정수형변수 = 정수형변수 * 3]과 같은 의미

/* 범위 연산자 */
// 닫힌(close) 연산자 ...
// 1...10 // 1부터 10까지
// 반닫힌(half close) 연산사 ..<
// 1..<10 // 1부터 9까지

/* 논리 연산자 */
// && : AND
// || : OR
// ! : NOT

/* nil */
// 다른 언어의 null과 같음
// 후에 optional에서 상세히 다룸

/* 자료형(Datatype) */
// F/T불대수 : Bool
// 정수 : Int, UInt (unsigned int: 양수만)
    // 크기에 따라 Int8, Int16, Int32, Int64
    // 그냥 Int는 사용하는 플랫폼에 따라 32또는 64로 설정
    // Int.max, Int.min을 사용해 최대/최소값을 확인 가능
print("UInt32.max=\(UInt32.max)")
print("UInt32.min=\(UInt32.min)")
print("Int64.max=\(Int64.max)")
print("Int64.min=\(Int64.min)")
// 실수 : Float, Double
// 문자 : Character
// 문자열 : String

/* 자료형변환(Typecasting) */
// 각 타입의 생성자의 파라미터를 사용
let 문자열로된수 = "1234"
let 정수로변환 = Int(문자열로된수)
print( 정수로변환! - 230 )
// 변환에 실패하면 nil이 됨

/* 타입 정보 받기 */
print( type(of: 실수형변수) )
print( type(of: 문자열로된수) )
print( type(of: 정수로변환) )

